app/controllers/registration_controller.rb

INSERT INTO `teams` (`name`, `created_at`, `updated_at`) VALUES('testowa', '2011-04-08 12:53:22', '2011-04-08 12:53:22')
---
  def create
    @team = Team.new
    @checked = false

    if params[:accepted] == "1"
      @checked = true
      @team = Team.new(:name => params[:team][:name])
      if @team.valid?
        if @team.save

SELECT `teams`.id FROM `teams` WHERE (`teams`.`name` = BINARY 'Jaka' AND `teams`.id <> 65) LIMIT 1
---
  def update
    @team = Team.find_by_name(params[:team][:name])

SELECT * FROM `teams` WHERE (`teams`.`id` = 4)
---
  def thanks
    @team = Team.find(params[:id])

SELECT * FROM `players` WHERE (`players`.`id` = 43)
UPDATE `players` SET `updated_at` = '2011-04-23 18:07:01', `verified` = 1 WHERE `id` = 44
---
  def validate
    player = Player.find(params[:id])
    hash = params[:hash]
    if Digest::SHA1.hexdigest(player.salt) == hash
      player.update_attributes(:verified => true)